app/views/samples/_close.html.erb

SELECT "samples".* FROM "samples" WHERE "samples"."request_id" = $1  [["request_id", 1]]
SELECT COUNT(*) FROM "samples" WHERE "samples"."request_id" = $1  [["request_id", 1]]
---
<h5><strong>Request Closed:  </strong><%=@request.time_completed.strftime("%A,  %B %d @ %H:%M:%S") %></h5>
<h6><strong># Samples:  </strong><%= @request.samples.count %></h6>