app/controllers/requests_controller.rb

SELECT "requests".* FROM "requests"
SELECT "requests".* FROM "requests" WHERE "requests"."complete" = $1  [["complete", true]]
SELECT "requests".* FROM "requests" WHERE "requests"."time_completed" IS NULL
---
    def index
        @requests = Request.all
        @requests.reverse
        @complete_requests = Request.where(complete: true)
        @complete_requests.sort{|x,y| y.time_completed - x.time_completed}
        @incomplete_requests = Request.where(time_completed: nil)

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def show
        @request = Request.find(params[:id])

UPDATE "requests" SET "time_completed" = $1, "updated_at" = $2 WHERE "requests"."id" = $3  [["time_completed", "2018-04-16 05:10:42.434406"], ["updated_at", "2018-04-16 05:10:42.434891"], ["id", 1]]
---
    def close_out
        @request.update_attribute(:time_completed,  Time.now.in_time_zone)