app/controllers/samples_controller.rb

    def complete
      @sample.update_attribute(:time_completed, Time.now)
---
UPDATE "samples" SET "time_completed" = $1, "updated_at" = $2 WHERE "samples"."id" = $3  [["time_completed", "2018-04-15 06:24:07.999580"], ["updated_at", "2018-04-15 06:24:08.000307"], ["id", 17]]

    def remove_complete
      @sample.update_attribute(:time_completed, nil)
---
UPDATE "samples" SET "time_completed" = $1, "updated_at" = $2 WHERE "samples"."id" = $3  [["time_completed", nil], ["updated_at", "2018-04-17 02:26:27.039043"], ["id", 17]]

    def set_as_empty
      @sample.update_attribute(:is_empty, true)
---
UPDATE "samples" SET "is_empty" = $1, "updated_at" = $2 WHERE "samples"."id" = $3  [["is_empty", true], ["updated_at", "2018-04-21 23:36:39.233155"], ["id", 10]]

    def set_request
      @request = Request.find(params[:request_id])
---
SELECT  "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def set_sample
      @sample = @request.samples.find(params[:id])
---
SELECT  "samples".* FROM "samples" WHERE "samples"."request_id" = $1 AND "samples"."id" = $2 LIMIT $3  [["request_id", 5], ["id", 17], ["LIMIT", 1]]